app/Http/Controllers/Api/ReviewsController.php

select * from `reviews`
---
    public function index()
    {
        $reviews = Reviews::all();

insert into `reviews` (`rate`, `review_content`, `user_id`, `updated_at`, `created_at`) values (2, 'Très beau séjour dans votre hotel', 3, '2025-01-15 14:26:01', '2025-01-15 14:26:01')
---
    public function store(Request $request)
    {
        try {
            $validatedData = $request->validate([
                'rate' => 'bail|required|integer',
                'review_content' => 'bail|required|string',
                'user_id' => 'bail|required|integer',
            ]);


            $review = new Reviews($validatedData);
            $review->save();