app/Http/Controllers/Api/RoomsCategoryController.php

        public function index(): \Illuminate\Http\JsonResponse
        {
            $categories = RoomsCategory::all();
---
select * from `rooms_categories`

        public function store(Request $request): \Illuminate\Http\JsonResponse
        {
            try {
                // Validation des données entrantes
                $validatedData = $request->validate([
                    'description' => 'bail|required|string|max:255',
                    'price_in_cents' => 'bail|required|integer',
                    'bed_size' => 'bail|required|integer',
                ]);

                // Création et sauvegarde de la nouvelle catégorie
                $roomCategory = new RoomsCategory($validatedData);
                $roomCategory->save();
---
insert into `rooms_categories` (`description`, `price_in_cents`, `bed_size`, `updated_at`, `created_at`) values ('Plus grande suite de l\'hotel', 399000000, 145, '2025-01-15 09:21:12', '2025-01-15 09:21:12')