app/Http/Controllers/Api/RoomsFeatureController.php

select * from `rooms_features`
---
    public function index(): \Illuminate\Http\JsonResponse
    {
        $features = RoomsFeature::all();

insert into `rooms_features` (`name`, `description`, `updated_at`, `created_at`) values ('WIFI', 'Wifi très haut débit', '2025-01-15 08:32:23', '2025-01-15 08:32:23')
---
    public function store(Request $request): \Illuminate\Http\JsonResponse
    {
        try {
            // Validation des données entrantes
            $validatedData = $request->validate([
                'name' => 'required|string|max:255',
                'description' => 'nullable|string',
            ]);

            // Création et sauvegarde de la nouvelle catégorie
            $roomFeature = new RoomsFeature($validatedData);
            $roomFeature->save();