app/Http/Controllers/Api/RoomsController.php

select * from `rooms`
---
    public function index(): \Illuminate\Http\JsonResponse
    {
        $rooms = Rooms::all();

insert into `rooms` (`number`, `description`, `price_in_cents`, `fk_has_rooms_categories`, `updated_at`, `created_at`) values (109, 'Chambre moyenne', 900000, 1, '2025-01-14 12:51:16', '2025-01-14 12:51:16')
---
    public function store(Request $request): \Illuminate\Http\JsonResponse
    {
        try {
            // Validation des données entrantes
            $validatedData = $request->validate([
                'number' => 'bail|required|integer',
                'description' => 'bail|required|string|max:255',
                'price_in_cents' => 'bail|required|integer',
                'rooms_category_id' => 'bail|required|integer',
            ]);

            // Création et sauvegarde de la nouvelle catégorie
            $room = new Rooms($validatedData);
            $room->save();

select * from `rooms` where `rooms`.`id` = '2' limit 1
delete from `rooms` where `id` = 2
---
    public function destroy(string $id): \Illuminate\Http\JsonResponse
    {
        $room = Rooms::findOrFail($id);

        if (!$room) {
            return response()->json(['error' => 'chambre non trouvée'], 404);
        }

        $room->delete();